In [ ]:
#titanic 머신러닝
#test (문제)
#train ()

In [1]:
import pandas as pd

In [2]:
train = pd.read_csv('titanic/train.csv')

In [ ]:
train = pd.read_csv('./titanic/train.csv') #=train = pd.read_csv('titanic/train.csv')

('../ # 상대경로)

In [3]:
train.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [12]:
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# PassengerId: 승객 번호 (object)
# Survived : 생존한 사람 (1: 생존한 사람, 0: 사망한 사람) (object)
# Pclass : 등급 (1, 2, 3) (object)
# SibSp: 사촌 + 배우자의 수 (숫자)
# Parch: 부모님 + 아이들 수 (숫자)
# Ticket: 티켓 번호 (object)
# Fare : 요금 (숫자)
# Cabin: 배안의 객실 (object)
# Embarked : 탑승한 선착장 (object)

In [8]:
train.shape #사용할 수 있는 건 11개? 왜?

(891, 12)

In [9]:
train.isnull().sum() # .isnull()은 null의 갯수를 파악할 때 사용함

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
# 분류 (classification): 분류할 때 사용 / 회귀(regression): 값을 예측할 때 사용

In [ ]:
# binary classification (2개 분류)
# multi classification (3개 이상 분류)

In [ ]:
# 우리가 할 것은 '분류'이다.

In [ ]:
# 이 데이터 안에 살아있는 사람과 죽어있는 사람의 수는?

In [11]:
train['Survived'].value_counts() #0: 죽은사람, 1: 생존한 사람

0    549
1    342
Name: Survived, dtype: int64

In [13]:
train['Pclass'].value_counts() #0: 죽은사람, 1: 생존한 사람

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [18]:
train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

male      False
female    False
Name: Sex, dtype: bool

남자인데, pclass3에 탄사람은?
성별로 pclass에 탄사람은?
pclass에 타서 생존한 사람은?

In [20]:
#남자인데, pclass3에 탄사람은?
len(train[(train['Sex'] == 'male') & (train['Pclass'] == 3)])

347

In [21]:
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [26]:
len(train[(train['Sex'] == 'female') & (train['Pclass'] == 2)])

76

In [ ]:
# pclass 2 , 생존한사람의 수는?

In [30]:
len(train[(train['Pclass'] == 2) & (train['Survived'] == 1)])

87

In [ ]:
# 강사님 문제

M 0
M 1

M = 50 %

M 0
M 1
M 1

M = 75 %

In [32]:
train.groupby('Sex')['Survived'].mean() #성별이 여자이면 생존 확률 증가

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [33]:
train.groupby('Pclass')['Survived'].mean() #등급이 높을 수록 생존 확률 증가

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [35]:
train.groupby('SibSp')['Survived'].mean().sort_values(ascending=False)

SibSp
1    0.535885
2    0.464286
0    0.345395
3    0.250000
4    0.166667
5    0.000000
8    0.000000
Name: Survived, dtype: float64

In [39]:
train['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [40]:
train.groupby('Parch')['Survived'].mean().sort_values(ascending=False)

Parch
3    0.600000
1    0.550847
2    0.500000
0    0.343658
5    0.200000
4    0.000000
6    0.000000
Name: Survived, dtype: float64

In [41]:
train['Parch'].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [42]:
train.groupby('Embarked')['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

In [ ]:
# pclass별, 성별, 생존 확률은?

In [47]:
train.groupby(['Pclass', 'Sex'])['Survived'].mean().sort_values(ascending=False)

Pclass  Sex
1       female    0.968085
2       female    0.921053
3       female    0.500000
1       male      0.368852
2       male      0.157407
3       male      0.135447
Name: Survived, dtype: float64

In [ ]:
# pcass별, 요금의 평균은?

In [48]:
train.groupby('Pclass')['Fare'].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [49]:
train.groupby('Embarked')['Fare'].mean()

Embarked
C    59.954144
Q    13.276030
S    27.079812
Name: Fare, dtype: float64

In [ ]:
# pclass별, 성별, survived할 확률 + fare의 평균은?

In [52]:
train.groupby(['Pclass', 'Sex'])[['Survived', 'Fare']].mean().sort_values(by='Fare', ascending=False)

               Survived        Fare
Pclass Sex
1      female  0.968085  106.125798
       male    0.368852   67.226127
2      female  0.921053   21.970121
       male    0.157407   19.741782
3      female  0.500000   16.118810
       male    0.135447   12.661633

In [56]:
train.groupby(['Pclass', 'Sex'])[['Survived', 'Fare']].mean() #실제로 등급이 높을수록 요금을 많이 썼음

               Survived        Fare
Pclass Sex
1      female  0.968085  106.125798
       male    0.368852   67.226127
2      female  0.921053   21.970121
       male    0.157407   19.741782
3      female  0.500000   16.118810
       male    0.135447   12.661633

In [ ]:
#데이터분석과 머신러닝의 차이점은?

22-10-28(금)은 
-타이타닉 조금 더 한다.
-머신러닝을 하기 전 전처리 배울 예정 
(map과 where)